{
  "visualizations": {
    "viz_m08pbSn8": {
      "type": "splunk.area",
      "options": {},
      "dataSources": {
        "primary": "ds_uUxGQkwn"
      }
    },
    "viz_QOZlqYEa": {
      "type": "splunk.pie",
      "options": {},
      "dataSources": {
        "primary": "ds_67PX3yUh"
      }
    },
    "viz_cEFE0V5X": {
      "type": "splunk.bar",
      "options": {},
      "dataSources": {
        "primary": "ds_VZn3Eu6X"
      }
    },
    "viz_rkbdxoXJ": {
      "type": "splunk.table",
      "options": {},
      "dataSources": {
        "primary": "ds_ez7c0PrV"
      }
    }
  },
  "dataSources": {
    "ds_uUxGQkwn": {
      "type": "ds.search",
      "options": {
        "query": "index=main EventCode=4625\r\n| timechart span=3s count as \"Failures per 3s\"\r\n| rename count as \"Attack Intensity\""
      },
      "name": "Area"
    },
    "ds_67PX3yUh": {
      "type": "ds.search",
      "options": {
        "query": "index=main EventCode=4625\r\n| stats count by Caller_Process_Name\r\n| rename Caller_Process_Name as \"Target Process\""
      },
      "name": "Pie chart"
    },
    "ds_VZn3Eu6X": {
      "type": "ds.search",
      "options": {
        "query": "index=main EventCode=4625\r\n| stats count by Account_Name\r\n| sort - count\r\n| head 10"
      },
      "name": "Bar chart"
    },
    "ds_ez7c0PrV": {
      "type": "ds.search",
      "options": {
        "query": "index=main EventCode=4625\r\n| stats count by Failure_Reason, Logon_Type\r\n| sort - count"
      },
      "name": "Table"
    }
  },
  "defaults": {
    "dataSources": {
      "ds.search": {
        "options": {
          "queryParameters": {
            "latest": "$global_time.latest$",
            "earliest": "$global_time.earliest$"
          }
        }
      },
      "ds.spl2": {
        "options": {
          "queryParameters": {
            "latest": "$global_time.latest$",
            "earliest": "$global_time.earliest$"
          }
        }
      }
    },
    "visualizations": {
      "global": {
        "showProgressBar": true
      }
    }
  },
  "inputs": {
    "input_global_trp": {
      "type": "input.timerange",
      "options": {
        "token": "global_time",
        "defaultValue": "-24h@h,now"
      },
      "title": "Global Time Range"
    }
  },
  "layout": {
    "options": {},
    "globalInputs": [
      "input_global_trp"
    ],
    "tabs": {
      "items": [
        {
          "layoutId": "layout_1",
          "label": "New tab"
        },
        {
          "layoutId": "layout_Te02fzfR",
          "label": "New tab"
        }
      ]
    },
    "layoutDefinitions": {
      "layout_1": {
        "type": "absolute",
        "structure": [
          {
            "item": "viz_m08pbSn8",
            "type": "block",
            "position": {
              "x": 0,
              "y": 40,
              "w": 1440,
              "h": 490
            }
          },
          {
            "item": "viz_QOZlqYEa",
            "type": "block",
            "position": {
              "x": 10,
              "y": 530,
              "w": 520,
              "h": 420
            }
          },
          {
            "item": "viz_cEFE0V5X",
            "type": "block",
            "position": {
              "x": 530,
              "y": 530,
              "w": 890,
              "h": 410
            }
          }
        ],
        "options": {
          "width": 1440,
          "height": 960,
          "display": "auto"
        }
      },
      "layout_Te02fzfR": {
        "type": "absolute",
        "structure": [
          {
            "item": "viz_rkbdxoXJ",
            "type": "block",
            "position": {
              "x": 0,
              "y": 0,
              "w": 1430,
              "h": 480
            }
          }
        ],
        "options": {
          "width": 1440
        }
      }
    }
  },
  "description": "",
  "title": "Brute force attack"
}